# '''Hапишіть программу "Касир в кінотеатрі", яка буде виконувати наступне:
#
# Попросіть користувача ввести свсвій вік.
#
# - якщо користувачу менше 7 - вивести "Тобі ж <>! Де твої батьки?"
#
# - якщо користувачу менше 16 - вивести "Тобі лише <>, а це е фільм для дорослих!"
#
# - якщо користувачу більше 65 - вивести "Вам <>? Покажіть пенсійне посвідчення!"
#
# - якщо вік користувача містить 7 - вивести "Вам <>, вам пощастить"
#
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <>, білетів всеодно нема!"
#
# Замість <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік
#
# Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача (1 - рік, 22 - роки, 35 - років і тд...).
#
# Наприклад :
#
# "Тобі ж 5 років! Де твої батьки?"
#
# "Вам 81 рік? Покажіть пенсійне посвідчення!"
#
# "Незважаючи на те, що вам 42 роки, білетів всеодно нема!"
#
# Зробіть все за допомогою функцій! Не забувайте що кожна функція має виконувати тільки одне завдання і про правила написання коду.'''




result = []
user_input = input('Введіть свій вік:')
def age_check():
    age2 = user_input
    if user_input.endswith('0'):
         result.append('років')
    if user_input.endswith('5'):
        result.append('років')
    if user_input.endswith('6'):
         result.append('років')
    if user_input.endswith('7'):
         result.append('років')
    if user_input.endswith('8'):
         result.append('років')
    if user_input.endswith('9'):
         result.append('років')
    if user_input.endswith('1'):
         result.append('рік')
    if user_input.endswith('2'):
        result.append('роки')
    if user_input.endswith('3'):
         result.append('роки')
    if user_input.endswith('4'):
         result.append('роки')

def user_data():
    if user_input.isdigit():
        age = int(user_input)
        if '7' in str(age):
            print("Вам сьогодні пощастить")
        elif age >= 190:
            print(f'Незважаючи на те, що вам {age} {result[0]}, білетів всеодно нема!')
        elif age == 0:
            print(f'Незважаючи на те, що вам {age} {result[0]}, білетів всеодно нема!')
        elif age < 16:
            print(f'Тобі лише {age} {result[0]}, а це е фільм для дорослих!')
        elif age > 65:
            print(f'Вам {age} {result[0]}? Покажіть пенсійне посвідчення!')
        else:
            print(f'Незважаючи на те, що вам {age} {result[0]}, білетів всеодно нема!')
    else:
        print('Ви ввели неправильні дані')

age_check() ,user_data()